IdeaRS.Connections
MemberOpeningData Properties
Compatible with IDEA StatiCa 0.0
The MemberOpeningData type exposes the following members.
Properties
Name | Description
CountX
 Count of multiply openings in X axis direction
 (Inherited from PlateOpeningData.)
DeltaX
 Distance between multiply openings in X axis direction
 (Inherited from PlateOpeningData.)
IsActive |  (Inherited from ConnectionCmdData.)
MemberPath
 Gets or sets the member
 (Inherited from PlateOpeningData.)
Name
 Gets or set the name
 (Inherited from ConnectionCmdData.)
OffsetX
 Gets or sets the horizontal offset of the opening from the relative point
 (Inherited from PlateOpeningData.)
OffsetY
 Gets or sets the vertical offset of the opening from the relative point
 (Inherited from PlateOpeningData.)
OpeningStiffener |  (Inherited from PlateOpeningData.)
OpeningStiffenerEdgeIndexes |  (Inherited from PlateOpeningData.)
OpeningStiffenerMaterialName
 Gets or sets the name of the material If value is null or empty material is taken from column
 (Inherited from PlateOpeningData.)
OpeningStiffenerThickness
 Gets or sets the thickness of the stiffener plate
 (Inherited from PlateOpeningData.)
OpeningStiffenerWeld |  (Inherited from PlateOpeningData.)
OpeningStiffenerWidth |  (Inherited from PlateOpeningData.)
OperationId
 Gets or sets the identifier of the operation in the manufacturer sequence
 (Inherited from ConnectionCmdData.)
Param1
 Gets or sets the parameter 1 Rectangle width or circle diameter
 (Inherited from PlateOpeningData.)
Param11
 For notch (NonReguralRectangle): B1 B2 B1: Base dimension in the plate axis x. B2: Additional dimension in the plate axis x.
 (Inherited from PlateOpeningData.)
Param12
 For notch (NonReguralRectangle): H1 H2 H1: Base dimension in the plate axis y. H2: Additional dimension in the plate axis y.
 (Inherited from PlateOpeningData.)
Param2
 Gets or sets the parameter 2 Rectangle height
 (Inherited from PlateOpeningData.)
Param21
 Ngon = n sides of regural polygon
 (Inherited from PlateOpeningData.)
Param3
 Gets or sets the parameter 3 Rectangle roundings
 (Inherited from PlateOpeningData.)
PlatePath
 Gets or sets the plate
 (Inherited from PlateOpeningData.)
PositionCode
 Gets or sets the notch (notch or dog bone) position. Supported is left, right and both.
 (Inherited from PlateOpeningData.)
RelativePointCode
 Gets or sets the code of the relative point on the plate 1 - left bottom edge
 (Inherited from PlateOpeningData.)
Rotation
 Rotation of opening around plate Z-axis.
 (Inherited from PlateOpeningData.)
ShapeCode
 Gets or sets the code of the opening 1 - rectangle 2 - circle PlateShapeCode.NonRegularRectangle - general square notch PlateShapeCode.Trapezoid - dog bone PlateShapeCode.CircularSegment - dog bone arc PlateShapeCode.Ngon - n-uhelnik
 (Inherited from PlateOpeningData.)
Top
See Also
Reference
MemberOpeningData Class
IdeaRS.Connections.Data Namespace